БИТУправление_медицинским_центром_демо/src/DataProcessors/ПоискДокументовРЭМД/ПоискДокументовРЭМД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПоискДокументовРЭМД</name>
  <comment>searchRegistryItem</comment>
  <attributes>
    <name>СНИЛС</name>
    <comment>Страховой номер индивидуального лицевого счета пенсионного свидетельства </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/Catalogs/ХранилищеДополнительнойИнформации/ХранилищеДополнительнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеДополнительнойИнформации</name>
  <attributes>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <comment>Хранилище</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВФайле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Классификация</name>
    <type>
      <types>CatalogRef.КлассификацияПрикрепленныхФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйВладелец</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/DataProcessors/ПоискДокументовРЭМД/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает статусы запрошенных документов
//
// Параметры:
//  ЗапрошенныеДокументы - Массив - массив ссылок на документы.
//  АдресРезультата		 - Строка - адрес результата.
//
Процедура ОбновитьСтатусыЗапрошенныхДокументов(ЗапрошенныеДокументы, АдресРезультата = Неопределено) Экспорт
	
	МассивИдентификаторовРЭМД = Новый Массив;
	Для Каждого СтрокаДокумента Из ЗапрошенныеДокументы Цикл
		МассивИдентификаторовРЭМД.Добавить(СтрокаДокумента.emdrid);
	КонецЦикла;
	
	ПолученныеФайлы = ПолучитьФайлыДокументовПоУИДРЭМД(МассивИдентификаторовРЭМД);
	
	УИДыПолученныхФайлов = Новый Массив;
	
	Для Каждого ЗапрошенныйДокумент Из ЗапрошенныеДокументы Цикл
		ЗапрошенныйДокумент.ФайлДокумента = ПолученныеФайлы.Получить(ЗапрошенныйДокумент.emdrid);
		Если ЗначениеЗаполнено(ЗапрошенныйДокумент.ФайлДокумента) Тогда
			УИДыПолученныхФайлов.Добавить(ЗапрошенныйДокумент.emdrid);
		Иначе
			ЗапрошенныйДокумент.ОтправленЗапросНаПолучение = Не ЗначениеЗаполнено(ЗапрошенныйДокумент.ФайлДокумента);
		КонецЕсли;
	КонецЦикла;
	
	Если АдресРезультата <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(УИДыПолученныхФайлов, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

// Получить файлы документов по УИДРЭМД.
//
// Параметры:
//  МассивИдентификаторовРЭМД	 - Массив	 - массив идентификаторов
// 
// Возвращаемое значение:
//  Соответствие - файлы документов.
//
Функция ПолучитьФайлыДокументовПоУИДРЭМД(МассивИдентификаторовРЭМД) Экспорт
	
	ФайлыПоИдентификаторуРЭМД = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформации.Ссылка КАК Ссылка,
	|	ХранилищеДополнительнойИнформации.Идентификатор КАК Идентификатор
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.Классификация = &Классификация
	|	И ХранилищеДополнительнойИнформации.Идентификатор В(&ИдентификаторыРЭМД)
	|	И ХранилищеДополнительнойИнформации.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ИдентификаторыРЭМД", МассивИдентификаторовРЭМД);
	Запрос.УстановитьПараметр("Классификация", Справочники.КлассификацияПрикрепленныхФайлов.ИзВнешнейМИС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ФайлыПоИдентификаторуРЭМД.Получить(Выборка.Идентификатор) = Неопределено Тогда
			ФайлыПоИдентификаторуРЭМД.Вставить(Выборка.Идентификатор, Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ФайлыПоИдентификаторуРЭМД;
	
КонецФункции

#КонецОбласти
